MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA606/mcu.h
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
typedef struct tagRPOR12BITS {
  uint16_t RP24R:7;
  uint16_t :1;
  uint16_t RP25R:7;
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
typedef struct tagRPOR13BITS {
  uint16_t RP26R:7;
  uint16_t :1;
  uint16_t RP27R:7;
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
typedef struct tagRPOR14BITS {
  uint16_t RP28R:7;
  uint16_t :1;
  uint16_t RP29R:7;
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
typedef struct tagRPOR15BITS {
  uint16_t RP30R:7;
} RPOR15BITS;
extern volatile RPOR15BITS RPOR15bits __attribute__((__sfr__));



/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* DSRPAG */
#define _DSRPAG DSRPAGbits.DSRPAG

/* DSWPAG */
#define _DSWPAG DSWPAGbits.DSWPAG

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2
#define _DC SRbits.DC
#define _IPL SRbits.IPL

/* CORCON */
#define _IPL3 CORCONbits.IPL3

/* DISICNT */
#define _DISICNT DISICNTbits.DISICNT

/* TBLPAG */
#define _TBLPAG TBLPAGbits.TBLPAG

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _INT3EP INTCON2bits.INT3EP
#define _INT4EP INTCON2bits.INT4EP
#define _AIVTEN INTCON2bits.AIVTEN
#define _SWTRAP INTCON2bits.SWTRAP
#define _DISI INTCON2bits.DISI
#define _GIE INTCON2bits.GIE

/* INTCON4 */
#define _SGHT INTCON4bits.SGHT
#define _ECCDBE INTCON4bits.ECCDBE

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _IC1IF IFS0bits.IC1IF
#define _OC1IF IFS0bits.OC1IF
#define _T1IF IFS0bits.T1IF
#define _DMA0IF IFS0bits.DMA0IF
#define _IC2IF IFS0bits.IC2IF
#define _OC2IF IFS0bits.OC2IF
#define _T2IF IFS0bits.T2IF
#define _T3IF IFS0bits.T3IF
#define _SPI1IF IFS0bits.SPI1IF
#define _SPI1TXIF IFS0bits.SPI1TXIF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _AD1IF IFS0bits.AD1IF
#define _DMA1IF IFS0bits.DMA1IF
#define _NVMIF IFS0bits.NVMIF

/* IFS1 */
#define _SI2C1IF IFS1bits.SI2C1IF
#define _MI2C1IF IFS1bits.MI2C1IF
#define _CMIF IFS1bits.CMIF
#define _IOCIF IFS1bits.IOCIF
#define _INT1IF IFS1bits.INT1IF
#define _CCP5IF IFS1bits.CCP5IF
#define _CCP6IF IFS1bits.CCP6IF
#define _DMA2IF IFS1bits.DMA2IF
#define _OC3IF IFS1bits.OC3IF
#define _OC4IF IFS1bits.OC4IF
#define _T4IF IFS1bits.T4IF
#define _T5IF IFS1bits.T5IF
#define _INT2IF IFS1bits.INT2IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF

/* IFS2 */
#define _SPI2IF IFS2bits.SPI2IF
#define _SPI2TXIF IFS2bits.SPI2TXIF
#define _DMA3IF IFS2bits.DMA3IF
#define _IC3IF IFS2bits.IC3IF
#define _IC4IF IFS2bits.IC4IF
#define _IC5IF IFS2bits.IC5IF
#define _IC6IF IFS2bits.IC6IF
#define _OC5IF IFS2bits.OC5IF
#define _OC6IF IFS2bits.OC6IF
#define _CCT3IF IFS2bits.CCT3IF
#define _CCT4IF IFS2bits.CCT4IF
#define _PMPIF IFS2bits.PMPIF
#define _DMA4IF IFS2bits.DMA4IF
#define _CCT5IF IFS2bits.CCT5IF

/* IFS3 */
#define _CCT6IF IFS3bits.CCT6IF
#define _SI2C2IF IFS3bits.SI2C2IF
#define _MI2C2IF IFS3bits.MI2C2IF
#define _CCT7IF IFS3bits.CCT7IF
#define _INT3IF IFS3bits.INT3IF
#define _INT4IF IFS3bits.INT4IF
#define _SPI1RXIF IFS3bits.SPI1RXIF
#define _SPI2RXIF IFS3bits.SPI2RXIF
#define _SPI3RXIF IFS3bits.SPI3RXIF
#define _DMA5IF IFS3bits.DMA5IF
#define _RTCIF IFS3bits.RTCIF
#define _CCP1IF IFS3bits.CCP1IF

/* IFS4 */
#define _CCP2IF IFS4bits.CCP2IF
#define _U1ERIF IFS4bits.U1ERIF
#define _U2ERIF IFS4bits.U2ERIF
#define _CRCIF IFS4bits.CRCIF
#define _DMA6IF IFS4bits.DMA6IF
#define _DMA7IF IFS4bits.DMA7IF
#define _SI2C3IF IFS4bits.SI2C3IF
#define _MI2C3IF IFS4bits.MI2C3IF
#define _LVDIF IFS4bits.LVDIF
#define _CCP7IF IFS4bits.CCP7IF
#define _CTMUIF IFS4bits.CTMUIF

/* IFS5 */
#define _U3ERIF IFS5bits.U3ERIF
#define _U3RXIF IFS5bits.U3RXIF
#define _U3TXIF IFS5bits.U3TXIF
#define _I2C1BCIF IFS5bits.I2C1BCIF
#define _I2C2BCIF IFS5bits.I2C2BCIF
#define _U4ERIF IFS5bits.U4ERIF
#define _U4RXIF IFS5bits.U4RXIF
#define _U4TXIF IFS5bits.U4TXIF
#define _SPI3IF IFS5bits.SPI3IF
#define _SPI3TXIF IFS5bits.SPI3TXIF
#define _CCP3IF IFS5bits.CCP3IF
#define _CCP4IF IFS5bits.CCP4IF

/* IFS6 */
#define _CLC1IF IFS6bits.CLC1IF
#define _CLC2IF IFS6bits.CLC2IF
#define _CLC3IF IFS6bits.CLC3IF
#define _CLC4IF IFS6bits.CLC4IF
#define _CCT1IF IFS6bits.CCT1IF
#define _CCT2IF IFS6bits.CCT2IF
#define _FSTIF IFS6bits.FSTIF
#define _I2C3BCIF IFS6bits.I2C3BCIF
#define _RTCCTSIF IFS6bits.RTCCTSIF
#define _U5RXIF IFS6bits.U5RXIF

/* IFS7 */
#define _U5TXIF IFS7bits.U5TXIF
#define _U5ERIF IFS7bits.U5ERIF
#define _U6RXIF IFS7bits.U6RXIF
#define _U6TXIF IFS7bits.U6TXIF
#define _U6ERIF IFS7bits.U6ERIF
#define _JTAGIF IFS7bits.JTAGIF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _IC1IE IEC0bits.IC1IE
#define _OC1IE IEC0bits.OC1IE
#define _T1IE IEC0bits.T1IE
#define _DMA0IE IEC0bits.DMA0IE
#define _IC2IE IEC0bits.IC2IE
#define _OC2IE IEC0bits.OC2IE
#define _T2IE IEC0bits.T2IE
#define _T3IE IEC0bits.T3IE
#define _SPI1IE IEC0bits.SPI1IE
#define _SPI1TXIE IEC0bits.SPI1TXIE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _AD1IE IEC0bits.AD1IE
#define _DMA1IE IEC0bits.DMA1IE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SI2C1IE IEC1bits.SI2C1IE
#define _MI2C1IE IEC1bits.MI2C1IE
#define _CMIE IEC1bits.CMIE
#define _IOCIE IEC1bits.IOCIE
#define _INT1IE IEC1bits.INT1IE
#define _CCP5IE IEC1bits.CCP5IE
#define _CCP6IE IEC1bits.CCP6IE
#define _DMA2IE IEC1bits.DMA2IE
#define _OC3IE IEC1bits.OC3IE
#define _OC4IE IEC1bits.OC4IE
#define _T4IE IEC1bits.T4IE
#define _T5IE IEC1bits.T5IE
#define _INT2IE IEC1bits.INT2IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE

/* IEC2 */
#define _SPI2IE IEC2bits.SPI2IE
#define _SPI2TXIE IEC2bits.SPI2TXIE
#define _DMA3IE IEC2bits.DMA3IE
#define _IC3IE IEC2bits.IC3IE
#define _IC4IE IEC2bits.IC4IE
#define _IC5IE IEC2bits.IC5IE
#define _IC6IE IEC2bits.IC6IE
#define _OC5IE IEC2bits.OC5IE
#define _OC6IE IEC2bits.OC6IE
#define _CCT3IE IEC2bits.CCT3IE
#define _CCT4IE IEC2bits.CCT4IE
#define _PMPIE IEC2bits.PMPIE
#define _DMA4IE IEC2bits.DMA4IE
#define _CCT5IE IEC2bits.CCT5IE

/* IEC3 */
#define _CCT6IE IEC3bits.CCT6IE
#define _SI2C2IE IEC3bits.SI2C2IE
#define _MI2C2IE IEC3bits.MI2C2IE
#define _CCT7IE IEC3bits.CCT7IE
#define _INT3IE IEC3bits.INT3IE
#define _INT4IE IEC3bits.INT4IE
#define _SPI1RXIE IEC3bits.SPI1RXIE
#define _SPI2RXIE IEC3bits.SPI2RXIE
#define _SPI3RXIE IEC3bits.SPI3RXIE
#define _DMA5IE IEC3bits.DMA5IE
#define _RTCIE IEC3bits.RTCIE
#define _CCP1IE IEC3bits.CCP1IE

/* IEC4 */
#define _CCP2IE IEC4bits.CCP2IE
#define _U1ERIE IEC4bits.U1ERIE
#define _U2ERIE IEC4bits.U2ERIE
#define _CRCIE IEC4bits.CRCIE
#define _DMA6IE IEC4bits.DMA6IE
#define _DMA7IE IEC4bits.DMA7IE
#define _SI2C3IE IEC4bits.SI2C3IE
#define _MI2C3IE IEC4bits.MI2C3IE
#define _LVDIE IEC4bits.LVDIE
#define _CCP7IE IEC4bits.CCP7IE
#define _CTMUIE IEC4bits.CTMUIE

/* IEC5 */
#define _U3ERIE IEC5bits.U3ERIE
#define _U3RXIE IEC5bits.U3RXIE
#define _U3TXIE IEC5bits.U3TXIE
#define _I2C1BCIE IEC5bits.I2C1BCIE
#define _I2C2BCIE IEC5bits.I2C2BCIE
#define _U4ERIE IEC5bits.U4ERIE
#define _U4RXIE IEC5bits.U4RXIE
#define _U4TXIE IEC5bits.U4TXIE
#define _SPI3IE IEC5bits.SPI3IE
#define _SPI3TXIE IEC5bits.SPI3TXIE
#define _CCP3IE IEC5bits.CCP3IE
#define _CCP4IE IEC5bits.CCP4IE

