MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA606/mcu.h
#define _CNPUG_IOCPG7_POSITION                   0x00000007
#define _CNPUG_IOCPG7_MASK                       0x00000080
#define _CNPUG_IOCPG7_LENGTH                     0x00000001

#define _CNPUG_IOCPG8_POSITION                   0x00000008
#define _CNPUG_IOCPG8_MASK                       0x00000100
#define _CNPUG_IOCPG8_LENGTH                     0x00000001

#define _CNPUG_IOCPG9_POSITION                   0x00000009
#define _CNPUG_IOCPG9_MASK                       0x00000200
#define _CNPUG_IOCPG9_LENGTH                     0x00000001

#define _CNPUG_IOCPUG2_POSITION                  0x00000002
#define _CNPUG_IOCPUG2_MASK                      0x00000004
#define _CNPUG_IOCPUG2_LENGTH                    0x00000001

#define _CNPUG_IOCPUG3_POSITION                  0x00000003
#define _CNPUG_IOCPUG3_MASK                      0x00000008
#define _CNPUG_IOCPUG3_LENGTH                    0x00000001

#define _CNPUG_IOCPUG6_POSITION                  0x00000006
#define _CNPUG_IOCPUG6_MASK                      0x00000040
#define _CNPUG_IOCPUG6_LENGTH                    0x00000001

#define _CNPUG_IOCPUG7_POSITION                  0x00000007
#define _CNPUG_IOCPUG7_MASK                      0x00000080
#define _CNPUG_IOCPUG7_LENGTH                    0x00000001

#define _CNPUG_IOCPUG8_POSITION                  0x00000008
#define _CNPUG_IOCPUG8_MASK                      0x00000100
#define _CNPUG_IOCPUG8_LENGTH                    0x00000001

#define _CNPUG_IOCPUG9_POSITION                  0x00000009
#define _CNPUG_IOCPUG9_MASK                      0x00000200
#define _CNPUG_IOCPUG9_LENGTH                    0x00000001

#define _CNPUG_CNPUG2_POSITION                   0x00000002
#define _CNPUG_CNPUG2_MASK                       0x00000004
#define _CNPUG_CNPUG2_LENGTH                     0x00000001

#define _CNPUG_CNPUG3_POSITION                   0x00000003
#define _CNPUG_CNPUG3_MASK                       0x00000008
#define _CNPUG_CNPUG3_LENGTH                     0x00000001

#define _CNPUG_CNPUG6_POSITION                   0x00000006
#define _CNPUG_CNPUG6_MASK                       0x00000040
#define _CNPUG_CNPUG6_LENGTH                     0x00000001

#define _CNPUG_CNPUG7_POSITION                   0x00000007
#define _CNPUG_CNPUG7_MASK                       0x00000080
#define _CNPUG_CNPUG7_LENGTH                     0x00000001

#define _CNPUG_CNPUG8_POSITION                   0x00000008
#define _CNPUG_CNPUG8_MASK                       0x00000100
#define _CNPUG_CNPUG8_LENGTH                     0x00000001

#define _CNPUG_CNPUG9_POSITION                   0x00000009
#define _CNPUG_CNPUG9_MASK                       0x00000200
#define _CNPUG_CNPUG9_LENGTH                     0x00000001

#define _IOCPUG_IOCPG2_POSITION                  0x00000002
#define _IOCPUG_IOCPG2_MASK                      0x00000004
#define _IOCPUG_IOCPG2_LENGTH                    0x00000001

#define _IOCPUG_IOCPG3_POSITION                  0x00000003
#define _IOCPUG_IOCPG3_MASK                      0x00000008
#define _IOCPUG_IOCPG3_LENGTH                    0x00000001

#define _IOCPUG_IOCPG6_POSITION                  0x00000006
#define _IOCPUG_IOCPG6_MASK                      0x00000040
#define _IOCPUG_IOCPG6_LENGTH                    0x00000001

#define _IOCPUG_IOCPG7_POSITION                  0x00000007
#define _IOCPUG_IOCPG7_MASK                      0x00000080
#define _IOCPUG_IOCPG7_LENGTH                    0x00000001

#define _IOCPUG_IOCPG8_POSITION                  0x00000008
#define _IOCPUG_IOCPG8_MASK                      0x00000100
#define _IOCPUG_IOCPG8_LENGTH                    0x00000001

#define _IOCPUG_IOCPG9_POSITION                  0x00000009
#define _IOCPUG_IOCPG9_MASK                      0x00000200
#define _IOCPUG_IOCPG9_LENGTH                    0x00000001

#define _IOCPUG_IOCPUG2_POSITION                 0x00000002
#define _IOCPUG_IOCPUG2_MASK                     0x00000004
#define _IOCPUG_IOCPUG2_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG3_POSITION                 0x00000003
#define _IOCPUG_IOCPUG3_MASK                     0x00000008
#define _IOCPUG_IOCPUG3_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG6_POSITION                 0x00000006
#define _IOCPUG_IOCPUG6_MASK                     0x00000040
#define _IOCPUG_IOCPUG6_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG7_POSITION                 0x00000007
#define _IOCPUG_IOCPUG7_MASK                     0x00000080
#define _IOCPUG_IOCPUG7_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG8_POSITION                 0x00000008
#define _IOCPUG_IOCPUG8_MASK                     0x00000100
#define _IOCPUG_IOCPUG8_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG9_POSITION                 0x00000009
#define _IOCPUG_IOCPUG9_MASK                     0x00000200
#define _IOCPUG_IOCPUG9_LENGTH                   0x00000001

#define _IOCPUG_CNPUG2_POSITION                  0x00000002
#define _IOCPUG_CNPUG2_MASK                      0x00000004
#define _IOCPUG_CNPUG2_LENGTH                    0x00000001

#define _IOCPUG_CNPUG3_POSITION                  0x00000003
#define _IOCPUG_CNPUG3_MASK                      0x00000008
#define _IOCPUG_CNPUG3_LENGTH                    0x00000001

#define _IOCPUG_CNPUG6_POSITION                  0x00000006
#define _IOCPUG_CNPUG6_MASK                      0x00000040
#define _IOCPUG_CNPUG6_LENGTH                    0x00000001

#define _IOCPUG_CNPUG7_POSITION                  0x00000007
#define _IOCPUG_CNPUG7_MASK                      0x00000080
#define _IOCPUG_CNPUG7_LENGTH                    0x00000001

#define _IOCPUG_CNPUG8_POSITION                  0x00000008
#define _IOCPUG_CNPUG8_MASK                      0x00000100
#define _IOCPUG_CNPUG8_LENGTH                    0x00000001

#define _IOCPUG_CNPUG9_POSITION                  0x00000009
#define _IOCPUG_CNPUG9_MASK                      0x00000200
#define _IOCPUG_CNPUG9_LENGTH                    0x00000001

#define _CNPDG_IOCPDG2_POSITION                  0x00000002
#define _CNPDG_IOCPDG2_MASK                      0x00000004
#define _CNPDG_IOCPDG2_LENGTH                    0x00000001

#define _CNPDG_IOCPDG3_POSITION                  0x00000003
#define _CNPDG_IOCPDG3_MASK                      0x00000008
#define _CNPDG_IOCPDG3_LENGTH                    0x00000001

