MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA606/mcu.h
#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_P2ACTIV_POSITION                 0x0000000A
#define _NVMCON_P2ACTIV_MASK                     0x00000400
#define _NVMCON_P2ACTIV_LENGTH                   0x00000001

#define _NVMCON_SFTSWP_POSITION                  0x0000000B
#define _NVMCON_SFTSWP_MASK                      0x00000800
#define _NVMCON_SFTSWP_LENGTH                    0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADR_NVMADRL_POSITION                 0x00000001
#define _NVMADR_NVMADRL_MASK                     0x0000FFFE
#define _NVMADR_NVMADRL_LENGTH                   0x0000000F

#define _NVMADR_NVMADR_POSITION                  0x00000001
#define _NVMADR_NVMADR_MASK                      0x0000FFFE
#define _NVMADR_NVMADR_LENGTH                    0x0000000F

#define _NVMADRL_NVMADRL_POSITION                0x00000001
#define _NVMADRL_NVMADRL_MASK                    0x0000FFFE
#define _NVMADRL_NVMADRL_LENGTH                  0x0000000F

#define _NVMADRL_NVMADR_POSITION                 0x00000001
#define _NVMADRL_NVMADR_MASK                     0x0000FFFE
#define _NVMADRL_NVMADR_LENGTH                   0x0000000F

#define _NVMADRH_NVMADRH_POSITION                0x00000000
#define _NVMADRH_NVMADRH_MASK                    0x000000FF
#define _NVMADRH_NVMADRH_LENGTH                  0x00000008

#define _NVMADRH_NVMADRU_POSITION                0x00000000
#define _NVMADRH_NVMADRU_MASK                    0x000000FF
#define _NVMADRH_NVMADRU_LENGTH                  0x00000008

#define _NVMADRU_NVMADRH_POSITION                0x00000000
#define _NVMADRU_NVMADRH_MASK                    0x000000FF
#define _NVMADRU_NVMADRH_LENGTH                  0x00000008

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

#define _RPINR0_OCTRIG1R_POSITION                0x00000000
#define _RPINR0_OCTRIG1R_MASK                    0x0000003F
#define _RPINR0_OCTRIG1R_LENGTH                  0x00000006

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00003F00
#define _RPINR0_INT1R_LENGTH                     0x00000006

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000003F
#define _RPINR1_INT2R_LENGTH                     0x00000006

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x00003F00
#define _RPINR1_INT3R_LENGTH                     0x00000006

#define _RPINR2_INT4R_POSITION                   0x00000000
#define _RPINR2_INT4R_MASK                       0x0000003F
#define _RPINR2_INT4R_LENGTH                     0x00000006

#define _RPINR2_OCTRIG2R_POSITION                0x00000008
#define _RPINR2_OCTRIG2R_MASK                    0x00003F00
#define _RPINR2_OCTRIG2R_LENGTH                  0x00000006

#define _RPINR3_T2CKR_POSITION                   0x00000000
#define _RPINR3_T2CKR_MASK                       0x0000003F
#define _RPINR3_T2CKR_LENGTH                     0x00000006

#define _RPINR3_T3CKR_POSITION                   0x00000008
#define _RPINR3_T3CKR_MASK                       0x00003F00
#define _RPINR3_T3CKR_LENGTH                     0x00000006

#define _RPINR4_T4CKR_POSITION                   0x00000000
#define _RPINR4_T4CKR_MASK                       0x0000003F
#define _RPINR4_T4CKR_LENGTH                     0x00000006

#define _RPINR4_T5CKR_POSITION                   0x00000008
#define _RPINR4_T5CKR_MASK                       0x00003F00
#define _RPINR4_T5CKR_LENGTH                     0x00000006

#define _RPINR7_IC1R_POSITION                    0x00000000
#define _RPINR7_IC1R_MASK                        0x0000003F
#define _RPINR7_IC1R_LENGTH                      0x00000006

#define _RPINR7_IC2R_POSITION                    0x00000008
#define _RPINR7_IC2R_MASK                        0x00003F00
#define _RPINR7_IC2R_LENGTH                      0x00000006

#define _RPINR8_IC3R_POSITION                    0x00000000
#define _RPINR8_IC3R_MASK                        0x0000003F
#define _RPINR8_IC3R_LENGTH                      0x00000006

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x0000003F
#define _RPINR11_OCFAR_LENGTH                    0x00000006

#define _RPINR11_OCFBR_POSITION                  0x00000008
#define _RPINR11_OCFBR_MASK                      0x00003F00
#define _RPINR11_OCFBR_LENGTH                    0x00000006

#define _RPINR12_TCKIAR_POSITION                 0x00000000
#define _RPINR12_TCKIAR_MASK                     0x0000003F
#define _RPINR12_TCKIAR_LENGTH                   0x00000006

