MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA606/mcu.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown Out Enable bit:
**     BOREN_OFF            Brown Out Disabled
**     SWC                  Controlled by SBOREN
**     BOREN_NOSLP          Disabled for Sleep Modes
**     BOREN_ON             Brown Out Enable Bit
**
**   Low power regulator control:
**     LPCFG_ON             Retention Sleep controlled by RETEN
**     LPCFG_OFF            No Retention Sleep
**
**   Downside Voltage Protection Enable bit:
**     DNVPEN_DISABLE       Downside protection disabled when BOR is inactive
**     DNVPEN_ENABLE        Downside protection enabled using ZPBOR when BOR is inactive
**
*/

#define BOREN_OFF            0x000C
#define SWC                  0x000D
#define BOREN_NOSLP          0x000E
#define BOREN_ON             0x000F

#define LPCFG_ON             0x000B
#define LPCFG_OFF            0x000F

#define DNVPEN_DISABLE       0x0007
#define DNVPEN_ENABLE        0x000F

/* Register FICD (0x55f28)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x55f28),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     PGX3                 Communicate on PGEC3 and PGED3
**     PGX2                 Communicate on PGEC2 and PGED2
**     PGX1                 Communicate on PGEC1 and PGED1
**     ICS_PGX1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP Disable:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction disabled
**
*/

#define ICS_NONE             0x80A0
#define PGX3                 0x80A1
#define PGX2                 0x80A2
#define PGX1                 0x80A3
#define ICS_PGX1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDEVOPT1 (0x55f2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x55f2c),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   SOSC High Power Enable bit (valid only when SOSCSEL = 1:
**     SOSCHP_OFF           Enable SOSC low power mode
**     SOSCHP_ON            Enable SOSC high power mode (default)
**
**   Alternate Voltage Reference Location Enable bit:
**     ALTVREF_ALTVREFDIS   VREF+ and CVREF+ on RB0, VREF- and CVREF- on RB1
**     ALTVREF_ALTREFEN     VREF+ and CVREF+ on RA10, VREF- and CVREF- on RA9
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define SOSCHP_OFF           0x0016
#define SOSCHP_ON            0x001E

#define ALTVREF_ALTVREFDIS   0x000E
#define ALTVREF_ALTREFEN     0x001E

/* Register FBTSEQ (0x55ffc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x55ffc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**
*/



#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x400

#undef _FLASH_ROW
#define _FLASH_ROW 0x80

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __FBOOT_BASE 0x801800
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0xabe00

#define __FSEC_BASE 0xabf00
#define __FSEC_LENGTH 0x2

