MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA606/mcu.h
#define __FBSLIM_BASE 0xabf10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xabf14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xabf18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xabf1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xabf20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xabf24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xabf28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0xabf2c
#define __FDEVOPT1_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x55e00

#define __FSEC_BASE 0x55f00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x55f10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x55f14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x55f18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x55f1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x55f20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x55f24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x55f28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0x55f2c
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x55ffc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_U2TX 5
#define _RPOUT_U2RTS 6
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SS1OUT 9
#define _RPOUT_SDO2 10
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SS2OUT 12
#define _RPOUT_OC1 13
#define _RPOUT_OC2 14
#define _RPOUT_OC3 15
#define _RPOUT_OCM4 16
#define _RPOUT_OCM5 17
#define _RPOUT_OCM6 18
#define _RPOUT_U3TX 19
#define _RPOUT_U3RTS 20
#define _RPOUT_U4TX 21
#define _RPOUT_U4RTS 22
#define _RPOUT_SDO3 23
#define _RPOUT_SCK3OUT 24
#define _RPOUT_SS3OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_OCM7 27
#define _RPOUT_REFO 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_CLC2OUT 30
#define _RPOUT_RTCC 31

#endif
